In [47]:
# Aula 1 - Análise de Dados com Pandas

In [48]:
import pandas as pd

In [49]:
# Carrega o conjunto de dados
df = pd.read_csv("salaries.csv")

In [50]:
# Retorna as 5 primeiras linhas do DataFrame
df.head()

# Retorna a quantidade de linhas passadas como parametro
df.head(10)

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100.0,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100.0,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0.0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0.0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0.0,US,M
5,2025.0,EN,FT,Data Engineer,80000,USD,80000,US,0.0,US,M
6,2025.0,SE,FT,Data Scientist,185000,USD,185000,US,0.0,US,M
7,2025.0,SE,FT,Data Scientist,148000,USD,148000,US,0.0,US,M
8,2025.0,MI,FT,Data Scientist,135000,USD,135000,CA,0.0,CA,M
9,2025.0,MI,FT,Data Scientist,108000,USD,108000,CA,0.0,CA,M

In [51]:
# Retorna informações sobre o DataFrame
# Ex: número de entradas, tipos de dados e valores nulos
df.info()

<class 'pandas.DataFrame'>
RangeIndex: 74035 entries, 0 to 74034
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           74030 non-null  float64
 1   experience_level    74035 non-null  str
 2   employment_type     74035 non-null  str
 3   job_title           74035 non-null  str
 4   salary              74035 non-null  int64
 5   salary_currency     74035 non-null  str
 6   salary_in_usd       74035 non-null  int64
 7   employee_residence  74035 non-null  str
 8   remote_ratio        74034 non-null  float64
 9   company_location    74034 non-null  str
 10  company_size        74034 non-null  str
dtypes: float64(2), int64(2), str(7)
memory usage: 6.2 MB

In [52]:
# Retorna estatísticas descritivas do DataFrame
# Ex: média, desvio padrão, valores mínimos e máximos
df.describe()

          work_year        salary  salary_in_usd  remote_ratio
count  74030.000000  7.403500e+04   74035.000000  74034.000000
mean    2024.818884  1.628727e+05  156492.346552     19.862496
std        0.385362  2.284340e+05   76014.679446     39.876452
min     2022.000000  1.440000e+04   15157.000000      0.000000
25%     2025.000000  1.040000e+05  104000.000000      0.000000
50%     2025.000000  1.450000e+05  145000.000000      0.000000
75%     2025.000000  1.968000e+05  196000.000000      0.000000
max     2025.000000  3.000000e+07  800000.000000    100.000000

In [53]:
# Retorna o número de linhas e colunas do DataFrame
df.shape

(74035, 11)

In [54]:
# Armazena o número de linhas e colunas em variáveis separadas
linhas, colunas = df.shape[0], df.shape[1]
print('Linhas:', linhas)
print('Colunas:', colunas)

Linhas: 74035
Colunas: 11

In [55]:
# Retorna os nomes das colunas do DataFrame
df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='str')